<a href="https://colab.research.google.com/github/PatrickRuan/ML100Days/blob/master/homework/Day_007_HW.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 作業 : (Kaggle)鐵達尼生存預測

# [作業目標]
- 試著完成三種不同特徵類型的三種資料操作, 觀察結果
- 思考一下, 這三種特徵類型, 哪一種應該最複雜/最難處理

# [作業重點]
- 完成剩餘的八種 類型 x 操作組合 (In[6]~In[13], Out[6]~Out[13])
- 思考何種特徵類型, 應該最複雜

In [5]:
from google.colab import drive
drive.mount('/content/drive')
!cp -r drive/'My Drive'/教學/發布/22_ML_100/Data_Day007 .
!mv Data_Day007 data
# 載入基本套件
import pandas as pd
import numpy as np

# 讀取訓練與測試資料
data_path = 'data/'
df_train = pd.read_csv(data_path + 'titanic_train.csv')
df_test = pd.read_csv(data_path + 'titanic_test.csv')
df_train.shape

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

(891, 12)

In [6]:
# 重組資料成為訓練 / 預測用格式
train_Y = df_train['Survived']
ids = df_test['PassengerId']
df_train = df_train.drop(['PassengerId', 'Survived'] , axis=1)
df_test = df_test.drop(['PassengerId'] , axis=1)
df = pd.concat([df_train,df_test])
df.head()

   Pclass                                               Name  ... Cabin  Embarked
0       3                            Braund, Mr. Owen Harris  ...   NaN         S
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...   C85         C
2       3                             Heikkinen, Miss. Laina  ...   NaN         S
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...  C123         S
4       3                           Allen, Mr. William Henry  ...   NaN         S

[5 rows x 10 columns]

## 下方兩格務必取消 reset_index() 觀察結果
* df.dtype 會是一個 series, 需要 reset_index() 才會形成 dataframe 
* 做了 groupby 後，不論有沒有 reset_index() 都是 dataframe
* 但是沒作 reset_index() 的 dataframe columns 不好處理...

In [24]:
dtype_df = df.dtypes.reset_index()
type(dtype_df) #pandas.core.frame.DataFrame
dtype_df

      index        0
0    Pclass    int64
1      Name   object
2       Sex   object
3       Age  float64
4     SibSp    int64
5     Parch    int64
6    Ticket   object
7      Fare  float64
8     Cabin   object
9  Embarked   object

In [35]:
# 秀出資料欄位的類型與數量
dtype_df = df.dtypes.reset_index()
dtype_df.columns = ["Count", "Column Type"]
dtype_df = dtype_df.groupby("Column Type").aggregate('count').reset_index() 
#<class 'pandas.core.frame.DataFrame'> 
# dtype_df.columns::Index(['Column Type', 'Count'], dtype='object')

#dtype_df = dtype_df.groupby("Column Type").aggregate('count') 
#<class 'pandas.core.frame.DataFrame'>, 
# dtype_df.columns: Index(['Count'], dtype='object')
dtype_df

  Column Type  Count
0       int64      3
1     float64      2
2      object      5

In [36]:
#確定只有 int64, float64, object 三種類型後, 分別將欄位名稱存於三個 list 中
int_features = []
float_features = []
object_features = []
for dtype, feature in zip(df.dtypes, df.columns):
    if dtype == 'float64':
        float_features.append(feature)
    elif dtype == 'int64':
        int_features.append(feature)
    else:
        object_features.append(feature)
print(f'{len(int_features)} Integer Features : {int_features}\n')
print(f'{len(float_features)} Float Features : {float_features}\n')
print(f'{len(object_features)} Object Features : {object_features}')

3 Integer Features : ['Pclass', 'SibSp', 'Parch']

2 Float Features : ['Age', 'Fare']

5 Object Features : ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

# 作業1 
* 試著執行作業程式，觀察三種類型 (int / float / object) 的欄位分別進行( 平均 mean / 最大值 Max / 相異值 nunique )  
中的九次操作會有那些問題? 並試著解釋那些發生Error的程式區塊的原因?  

# 作業2
* 思考一下，試著舉出今天五種類型以外的一種或多種資料類型，你舉出的新類型是否可以歸在三大類中的某些大類?  
所以三大類特徵中，哪一大類處理起來應該最複雜?

In [ ]:
# 例 : 整數 (int) 特徵取平均 (mean)
df[int_features].mean()

Pclass    2.294882
SibSp     0.498854
Parch     0.385027
dtype: float64

In [55]:
# 請依序列出 三種特徵類型 (int / float / object) x 三種方法 (平均 mean / 最大值 Max / 相異值 nunique) 的其餘操作
"""
Your Code Here
"""
print('mean', df[int_features].mean(),'\n')
print('mean', df[float_features].mean(),'\n')
print('mean', df[object_features].mean(),'\n======================================\n\n')

print('std', df[int_features].std(),'\n')
print('std', df[float_features].std(),'\n')
print('std', df[object_features].std(),'\n======================================\n\n')

print('max', df[int_features].max(),'\n')
print('max', df[float_features].max(),'\n')
print('max', df[object_features].max(),'\n======================================\n\n')


print('min', df[int_features].min(),'\n')
print('min', df[float_features].min(),'\n')
print('min', df[object_features].min(),'\n======================================\n\n')


print('nunique', df[int_features].nunique(),'\n')
print('nunique', df[float_features].nunique(),'\n')
print('nunique', df[object_features].nunique(),'\n======================================\n\n')

mean Pclass    2.294882
SibSp     0.498854
Parch     0.385027
dtype: float64

mean Age     29.881138
Fare    33.295479
dtype: float64

mean Series([], dtype: float64)
======================================


std Pclass    0.837836
SibSp     1.041658
Parch     0.865560
dtype: float64

std Age     14.413493
Fare    51.758668
dtype: float64

std Series([], dtype: float64)
======================================


max Pclass    3
SibSp     8
Parch     9
dtype: int64

max Age      80.0000
Fare    512.3292
dtype: float64

max Series([], dtype: float64)
======================================


min Pclass    1
SibSp     0
Parch     0
dtype: int64

min Age     0.17
Fare    0.00
dtype: float64

min Series([], dtype: float64)
======================================


nunique Pclass    3
SibSp     7
Parch     8
dtype: int64

nunique Age      98
Fare    281
dtype: int64

nunique Name        1307
Sex            2
Ticket       929
Cabin        186
Embarked       3
dtype: int64
======================================